<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html dir="ltr" id="vbulletin_html" lang="en" xmlns="http://www.w3.org/1999/xhtml" xmlns:fb="http://www.facebook.com/2008/fbml"><!-- Mirrored from garage4hackers.com/showthread.php?t=1902&p=6870 by HTTraQt Website Copier/1.x [Karbofos 2012-2017] Sun, 22 Mar 2020 18:09:38 GMT --><!-- Added by HTTrack --><head><meta content="text/html;charset=utf-8" http-equiv="content-type"/><!-- /Added by HTTrack -->

	<meta content="text/html; charset=utf-8" http-equiv="Content-Type"/>
<meta content="index.html" id="e_vb_meta_bburl" name="vb_meta_bburl"/>
<base/><!--[if IE]></base><![endif]-->
<meta content="vBulletin 4.2.1" name="generator"/>
<meta content="IE=9" http-equiv="X-UA-Compatible"/>

	<link href="favicon.ico" rel="Shortcut Icon" type="image/x-icon"/>






	<meta content="170793809601191" property="fb:app_id"/>
<meta content="Garage4hackers Forum" property="og:site_name"/>
<meta content="Garage4Hackers(G4H) is an open security community for Information Security enthusiasts, gurus and aspirants.Members of the team dedicate time and resources towards helping other information security aspirants, sharing knowledge,spreading security awareness and promoting research." property="og:description"/>
<meta content="showthreadb7b7-2.html?t=1902" property="og:url"/>
<meta content="article" property="og:type"/>




	

				
					<span class="date">01-07-2012, <span class="time">12:29 PM</span></span>
				
			</span>
			<span class="nodecontrols">
				
					<a class="postcounter" href="showthread841c.html?t=1902&amp;p=6870&amp;viewfull=1#post6870" name="post6870">#4</a><a id="postcount6870" name="4"></a>
				
				
				
			</span>
	</div>
	<div class="postdetails">
		<div class="userinfo">
			<div class="username_container">
			
				<div class="popupmenu memberaction">
	<a class="username offline popupctrl" href="memberdb73.html?u=311" title="c0d3inj3cT is offline"><strong>c0d3inj3cT</strong></a>
	<ul class="popupbody popuphover memberaction_body">
		<li class="left">
			<a class="siteicon_profile" href="memberdb73.html?u=311">
				View Profile
			</a>
		</li>
		
		<li class="right">
			<a class="siteicon_forum" href="search9737.html?do=finduser&amp;userid=311&amp;contenttype=vBForum_Post&amp;showposts=1" rel="nofollow">
				View Forum Posts
			</a>
		</li>
		
		
		<li class="left">
			<a class="siteicon_message" href="private1fcf.html?do=newpm&amp;u=311" rel="nofollow">
				Private Message
			</a>
		</li>
		
		
		
		<li class="right">
			<a class="siteicon_blog" href="blogdb73.html?u=311" rel="nofollow">
				View Blog Entries
			</a>
		</li>
		
		
		
		
		
		<li class="right">
			<a class="siteicon_article" href="list1ee8.html?r=author/311-c0d3inj3cT" rel="nofollow">
				View Articles
			</a>
		</li>
		

		

		
		
	</ul>
</div>
				<img alt="c0d3inj3cT is offline" border="0" class="inlineimg onlinestatus" src="images/statusicon/user-offline.png"/>

			
			</div>
			<span class="usertitle">
				Garage Member
			</span>
			
			
			
				<span class="postbit_reputation" id="repdisplay_6870_311" title="c0d3inj3cT will become famous soon enough">
					
						<img alt="" class="repimg" src="images/reputation/reputation_pos.png"/>
					
						<img alt="" class="repimg" src="images/reputation/reputation_pos.png"/>
					
				</span>
			
			 
			
				<hr/>
				<dl class="userinfo_extra">
					<dt>Join Date</dt> <dd>Dec 2010</dd>
					
					
					<dt>Posts</dt> <dd>67</dd>	
					<dt>Blog Entries</dt><dd><a href="blogdb73.html?u=311">2</a></dd>
				</dl>
				
				
				<div class="imlinks">
					    
				</div>
			
		</div>
		<div class="postbody">
			<div class="postrow">
				
				


						
						
				<div class="content">
					<div id="post_message_6870">
						<blockquote class="postcontent restore">
							In the above method, I have dumped the contents of memory addresses (Flinks) and used the offsets to see what is there. But to understand better, we need to look <br/>
deeper into the double linked lists.<br/>
<br/>
The Flinks of the lists stored in _PEB_LDR_DATA structure actually point to a data structure, <b>_LDR_DATA_TABLE_ENTRY</b>.<br/>
<br/>
Let's view the structure.<br/>
<br/>
<div class="bbcode_container">
	<div class="bbcode_description">Code:</div>
	<pre class="bbcode_code" style="height:264px;">0:001&gt; dt nt!_LDR_DATA_TABLE_ENTRY
ntdll!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x008 InMemoryOrderLinks : _LIST_ENTRY
   +0x010 InInitializationOrderLinks : _LIST_ENTRY
   +0x018 DllBase          : Ptr32 Void
   +0x01c EntryPoint       : Ptr32 Void
   +0x020 SizeOfImage      : Uint4B
   +0x024 FullDllName      : _UNICODE_STRING
   +0x02c BaseDllName      : _UNICODE_STRING
   +0x034 Flags            : Uint4B
   +0x038 LoadCount        : Uint2B
   +0x03a TlsIndex         : Uint2B
   +0x03c HashLinks        : _LIST_ENTRY
   +0x03c SectionPointer   : Ptr32 Void
   +0x040 CheckSum         : Uint4B
   +0x044 TimeDateStamp    : Uint4B
   +0x044 LoadedImports    : Ptr32 Void
   +0x048 EntryPointActivationContext : Ptr32 Void
   +0x04c PatchInformation : Ptr32 Void</pre>
</div>As can be seen, the Lists in the data structure _PEB_LDR_DATA are pointing to Links in the _LDR_DATA_TABLE_ENTRY data structure.<br/>
<br/>
We saw before that, _LIST_ENTRY is a set of two pointers, flink and blink. But we could not see the data item of the double linked list. We will use the concept of macro <b>CONTAINING_RECORD</b> of linked lists to read the real data elements of the list.<br/>
<br/>
Let's look only at the fields of type, _LIST_ENTRY of the two structures:<br/>
<br/>
<div class="bbcode_container">
	<div class="bbcode_description">Code:</div>
	<pre class="bbcode_code" style="height:84px;">0:001&gt; dt nt!_PEB_LDR_DATA
ntdll!_PEB_LDR_DATA
   +0x00c InLoadOrderModuleList : _LIST_ENTRY
   +0x014 InMemoryOrderModuleList : _LIST_ENTRY
   +0x01c InInitializationOrderModuleList : _LIST_ENTRY</pre>
</div><div class="bbcode_container">
	<div class="bbcode_description">Code:</div>
	<pre class="bbcode_code" style="height:84px;">0:001&gt; dt nt!_LDR_DATA_TABLE_ENTRY
ntdll!_LDR_DATA_TABLE_ENTRY
   +0x000 InLoadOrderLinks : _LIST_ENTRY
   +0x008 InMemoryOrderLinks : _LIST_ENTRY
   +0x010 InInitializationOrderLinks : _LIST_ENTRY</pre>
</div>There is a one to one correspondence between the _LIST_ENTRY fields of the two structures. For instance, the InLoadOrderModuleList.Flink points to InLoadOrderLinks entry of _LDR_DATA_TABLE_ENTRY structure at offset 0.<br/>
<br/>
InMemoryOrderModuleList.Flink field of _PEB_LDR_DATA points into InMemoryOrderLinks field of _LDR_DATA_TABLE_ENTRY at offset 0x08<br/>
<br/>
InInitializationOrderModuleList.Flink field of _PEB_LDR_DATA points into InInitializationOrderLinks field of _LDR_DATA_TABLE_ENTRY at offset 0x010.<br/>
<br/>
In windbg, if you want to display the offsets of fields in a structure you can use the following command,<br/>
<br/>
<b>#FIELD_OFFSET(Structure Name, Field Name)</b><br/>
<br/>
Now, let's again take the above example shellcode and look into it:<br/>
<br/>
<b>Instruction 4:</b><br/>
<br/>
We got that the Flink of InInitializationOrderModuleList points to 0x001a1f28 which is stored in ebx.<br/>
<br/>
